# AnalysisDisplayLegend Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayLegend Class
Members See Also
---
The legend that describes an Analysis Visualization.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class AnalysisDisplayLegend : Element
```

Visual Basic
---
```text
Public Class AnalysisDisplayLegend _
	Inherits Element
```

Visual C++
---
```text
public ref class AnalysisDisplayLegend : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..AnalysisDisplayLegend
# See Also
AnalysisDisplayLegend Members
Autodesk.Revit.DB.Analysis Namespace